var swipe_arr = [[500,600,150,400,450],//右下滑
                 [500,200,150,400,450],//右上滑
                 [150,400,500,600,450],//左上滑
                 [150,400,500,200,450],//左下滑
                 [500,600,150,600,450],//右滑
                 [150,600,500,600,450],//左滑
                ];

//重複打
for(let t=0; t<5; t++){ //打5次關卡
    if(t==0) click(270,750);
    else press(270, 750, 1000); //長按冒險按鈕
    sleep(5000);
    if(t==0){//第一次必須選關卡
        click(270,450);
        sleep(3000);
        click(270,500);//(需調整)
        sleep(3000);
    }
    click(270, 450); //點關卡的畫面位置(需調整)
    sleep(3000);
    click(150, 500); //單人按鈕
    sleep(4000);
    click(270, 360); //幫手怪物選自己的
    sleep(3000);
    click(100, 700); // box
    sleep(2000);
    click(270, 800); //出擊按鈕(需調整)
    for(let i=0; i<100; i++){ //滑的次數(需調整)
        let r = Math.floor(Math.random()*6); 
        swipe.apply(this, swipe_arr[r]);//隨機角度滑
        sleep(2000);
    }
    for(let i=0; i<25; i++){
        click(270, 620); //出關按鈕
        sleep(1000);
    }
    sleep(15000);//暫停，可應對自動回體的狀況
}
alert("finish playing!");